---
type: PipeInsulation
namespace: Autodesk.Revit.DB.Plumbing
version: 2024
members: 2
tags: [revit-api, class]
---

# PipeInsulation

`Autodesk.Revit.DB.Plumbing.PipeInsulation` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Create | 2012 | `public static PipeInsulation Create ( Document document , ElementId pipeOrContentElementId , ElementId pipeInsulationTypeId , double Thickness )` |
| Property | Parameter | — | `` |